var movieslist = new Vue({
    el: '#conter',
    data() {
        return {
            type: ['全部', '爱情', '喜剧', '动画', '剧情', '恐怖', '惊悚', '科幻', '动作', '悬疑', '犯罪', '冒险', '战争', '奇幻', '家庭'],
            contry: ['全部', '大陆', '香港', '美国', '韩国', '日本', '泰国', '印度', '法国', '英国', '其他'],
            years: ['全部', '2020', '2019', '2016', '2010-2015', '2000-2009', '90年代', '80年代', '70年代', '更早'],
            typenum: 0,
            contry_num: 0,
            years_num: 0,
        }
    },
    methods: {
        typeactive(a) {
            this.typenum = a

        }
    }
})